{
  "title": "Over",
  "titleHighlight": "Mij",
  "introText": "ISTQB® Gecertificeerde Full-Stack Automation Engineer met ervaring in UI-, API- en databasetesten met gebruik van Java, Selenium, Cucumber, Postman en Rest Assured. Vaardig in het ontwerpen van schaalbare automatiseringsframeworks en het integreren ervan met CI/CD-pipelines. Bewezen staat van dienst in het bijdragen aan hoogwaardige releases in Agile-teams binnen de bank-, gezondheidszorg- en e-commercesectoren. Vloeiend in Nederlands, Engels en Turks (moedertaal).",
  "introQuote": "Gedreven door precisie, gevoed door nieuwsgierigheid. Ik transformeer handmatige testgangen in geautomatiseerde, herhaalbare systemen zodat teams duidelijke feedback krijgen en met vertrouwen kunnen leveren.",
  "story": "Mijn reis begon met een achtergrond in Wiskunde, wat de basis legde voor een gedisciplineerde en systematische aanpak van probleemoplossing. Deze analytische mindset dreef mijn vroege successen in e-commerce, waar ik wereldwijde verkoopstrategieën optimaliseerde, voordat ik mijn ware passie vond: Software Quality Engineering. In de loop der jaren ben ik gegroeid van handmatig tester naar Full-Stack Automation Engineer. Ik heb veerkrachtige testframeworks ontworpen voor complexe banksystemen bij ING en verken voortdurend de mogelijkheden van AI-gestuurde ontwikkeling. Voor mij draait coderen niet alleen om functionaliteit, maar om het bouwen van betrouwbare, schaalbare ecosystemen die teams in staat stellen om met vertrouwen te innoveren.",
  "yearsExperience": "Jaar Ervaring",
  "myJourney": "Mijn Reis",
  "whatIDo": "Wat Ik Doe",
  "basedIn": "Gevestigd in",
  "netherlands": "Nederland",
  "languages": "Talen",
  "languageList": "Engels, Nederlands, Turks",
  "badges": {
    "istqbCertified": "ISTQB® Gecertificeerd",
    "agileScrum": "Agile & Scrum",
    "fullStackQA": "Full-Stack QA"
  },
  "services": {
    "testAutomation": {
      "title": "Test Automation Architectuur",
      "description": "Het bouwen van robuuste, schaalbare end-to-end automatiseringsframeworks om softwarekwaliteit en betrouwbaarheid te waarborgen."
    },
    "cicd": {
      "title": "CI/CD & DevOps Integratie",
      "description": "Ontwerpen en onderhouden van pipelines voor continue integratie om deployment te versnellen en risico's te verminderen."
    },
    "apiBackend": {
      "title": "API & Backend Validatie",
      "description": "Implementeren van uitgebreide API-teststrategieën en databasevalidaties voor backend-integriteit."
    },
    "webDev": {
      "title": "AI-Aangedreven Web Development",
      "description": "Gebruikmaken van geavanceerde AI-coding agents en moderne architectuurpatronen om met snelheid en precisie professionele, krachtige webapplicaties te bouwen."
    },
    "ecommerce": {
      "title": "E-commerce Verkoopoptimalisatie",
      "description": "Implementeren van datagestuurde verkoopstrategieën en SEO-technieken om de productzichtbaarheid en omzet te maximaliseren op grote e-commerceplatforms zoals Amazon en eBay."
    }
  }
}
