{
  "title": "Kısaca",
  "titleHighlight": "Ben",
  "introText": "Java, Selenium, Cucumber, Postman ve Rest Assured kullanarak UI, API ve veritabanı testlerinde deneyime sahip ISTQB® Sertifikalı Full-Stack Otomasyon Mühendisi. Ölçeklenebilir otomasyon yapıları tasarlama ve bunları CI/CD süreçlerine entegre etme konusunda yetkin. Bankacılık, sağlık ve e-ticaret alanlarındaki Agile ekiplerde yüksek kaliteli sürümlere katkıda bulunma konusunda kanıtlanmış geçmişe sahip. Felemenkçe, İngilizce ve Türkçe (anadil) dillerini akıcı bir şekilde konuşabilen.",
  "introQuote": "Hassasiyetle motive olan, merakla güçlenen. Manuel test süreçlerini otomatik, tekrarlanabilir sistemlere dönüştürerek ekiplerin net geri bildirim almasını ve ürünlerini güvenle sunmasını sağlıyorum.",
  "story": "Yolculuğum, sistematik problem çözme konusunda disiplinli bir yaklaşım geliştirmemi sağlayan Matematik temeliyle başladı. Bu analitik zihniyet, e-ticaret alanındaki ilk başarılarımın önünü açtı ve burada küresel satış stratejilerini optimize ettim. Ardından asıl tutkum olan Yazılım Kalite Mühendisliğine geçiş yaptım. Yıllar içinde manuel test uzmanlığından Full-Stack Otomasyon Mühendisliğine evrildim; ING'deki karmaşık bankacılık sistemleri için dayanıklı test mimarileri tasarladım ve yapay zeka destekli geliştirmenin sınırlarını keşfetmeye devam ediyorum. Benim için kodlama sadece işlevsellikten ibaret değil; ekiplerin güvenle inovasyon yapmasını sağlayan güvenilir ve ölçeklenebilir ekosistemler inşa etmektir.",
  "yearsExperience": "Yıllık Deneyim",
  "myJourney": "Yolculuğum",
  "whatIDo": "Neler Yapıyorum",
  "basedIn": "Konum",
  "netherlands": "Hollanda",
  "languages": "Diller",
  "languageList": "İngilizce, Felemenkçe, Türkçe",
  "badges": {
    "istqbCertified": "ISTQB® Sertifikalı",
    "agileScrum": "Agile & Scrum",
    "fullStackQA": "Full-Stack QA"
  },
  "services": {
    "testAutomation": {
      "title": "Test Otomasyon Mimarisi",
      "description": "Yazılım kalitesini ve güvenilirliğini sağlamak için sağlam, ölçeklenebilir uçtan uca otomasyon iskeletleri oluşturma."
    },
    "cicd": {
      "title": "CI/CD & DevOps Entegrasyonu",
      "description": "Dağıtımı hızlandırmak ve riski azaltmak için sürekli entegrasyon süreçleri tasarlama ve sürdürme."
    },
    "apiBackend": {
      "title": "API & Backend Doğrulama",
      "description": "Backend bütünlüğü için kapsamlı API test stratejileri ve veritabanı doğrulamaları uygulama."
    },
    "webDev": {
      "title": "AI Destekli Web Geliştirme",
      "description": "Hız ve hassasiyetle profesyonel, yüksek performanslı web uygulamaları oluşturmak için gelişmiş AI kodlama ajanlarını ve modern mimari kalıpları kullanma."
    },
    "ecommerce": {
      "title": "E-ticaret Satış Optimizasyonu",
      "description": "Amazon ve eBay gibi büyük e-ticaret platformlarında ürün görünürlüğünü ve geliri en üst düzeye çıkarmak için veri odaklı satış stratejileri ve SEO teknikleri uygulama."
    }
  }
}
