{
  "title": "Kısaca",
  "titleHighlight": "Ben",
  "introText": "Java, Selenium, Cucumber, Postman ve Rest Assured kullanarak UI, API ve veritabanı testlerinde deneyimli ISTQB® Sertifikalı Full-Stack Otomasyon Mühendisi. Ölçeklenebilir otomasyon framework'leri tasarlayıp CI/CD pipeline'larına entegre etme konusunda uzman. Bankacılık, sağlık ve e-ticaret sektörlerindeki Agile ekiplerde kaliteli release'lere katkı sağlama konusunda kanıtlanmış bir deneyime sahip. Felemenkçe, İngilizce ve Türkçe (anadil) dillerinde akıcı.",
  "introQuote": "Hassasiyetle yönlendirilen, merakla beslenen. Manuel test süreçlerini otomatik, tekrarlanabilir sistemlere dönüştürerek ekiplerin net geri bildirim almasını ve güvenle teslim etmesini sağlıyorum.",
  "story": "Yolculuğum, sistematik problem çözme konusunda disiplinli bir yaklaşım kazandıran Matematik altyapısıyla başladı. Bu analitik bakış açısı, e-ticaret alanındaki ilk başarılarımı mümkün kıldı; burada global satış stratejilerini optimize ettim. Ardından asıl tutkum olan Yazılım Kalite Mühendisliğine yöneldim. Yıllar içinde manuel test uzmanlığından Full-Stack Otomasyon Mühendisliğine evrilirken, ING'deki kompleks bankacılık sistemleri için dayanıklı test framework'leri tasarladım ve AI destekli geliştirmenin sınırlarını keşfetmeye devam ediyorum. Benim için kodlama sadece işlevsellikten ibaret değil—ekiplerin güvenle inovasyon yapmasını sağlayan güvenilir ve ölçeklenebilir ekosistemler inşa etmektir.",
  "yearsExperience": "Yıllık Deneyim",
  "myJourney": "Yolculuğum",
  "whatIDo": "Neler Yapıyorum",
  "basedIn": "Konum",
  "netherlands": "Hollanda",
  "languages": "Diller",
  "languageList": "İngilizce, Felemenkçe, Türkçe",
  "badges": {
    "istqbCertified": "ISTQB® Sertifikalı",
    "agileScrum": "Agile & Scrum",
    "fullStackQA": "Full-Stack QA"
  },
  "services": {
    "testAutomation": {
      "title": "Test Otomasyon Mimarisi",
      "description": "Yazılım kalitesini ve güvenilirliğini sağlamak için sağlam, ölçeklenebilir end-to-end otomasyon framework'leri geliştirme."
    },
    "cicd": {
      "title": "CI/CD & DevOps Entegrasyonu",
      "description": "Deployment sürecini hızlandırmak ve riskleri azaltmak için sürekli entegrasyon pipeline'ları tasarlama ve sürdürme."
    },
    "apiBackend": {
      "title": "API & Backend Doğrulama",
      "description": "Backend bütünlüğü için kapsamlı API test stratejileri ve veritabanı validasyonları uygulama."
    },
    "webDev": {
      "title": "AI Destekli Web Geliştirme",
      "description": "Hız ve hassasiyetle profesyonel, yüksek performanslı web uygulamaları oluşturmak için gelişmiş AI coding agent'ları ve modern mimari pattern'ları kullanma."
    },
    "ecommerce": {
      "title": "E-Ticaret Satış Optimizasyonu",
      "description": "Amazon ve eBay gibi büyük e-ticaret platformlarında ürün görünürlüğünü ve geliri maksimize etmek için data-driven satış stratejileri ve SEO teknikleri uygulama."
    }
  }
}
