{
  "title": "About",
  "titleHighlight": "Me",
  "introText": "ISTQB® Certified Full-Stack Automation Engineer with experience in UI, API, and database testing using Java, Selenium, Cucumber, Postman, and Rest Assured. Skilled in designing scalable automation frameworks and integrating them with CI/CD pipelines. Proven track record of contributing to high-quality releases in Agile teams across banking, healthcare, and e-commerce domains. Fluent in Dutch, English, and Turkish (native).",
  "introQuote": "Driven by precision, powered by curiosity. I transform manual testing corridors into automated, repeatable systems so teams have clear feedback and confidence to ship.",
  "story": "My journey began with a foundation in Mathematics, cultivating a disciplined approach to systematic problem-solving. This analytical mindset drove my initial success in e-commerce, where I optimized global sales strategies, before transitioning into my true passion: Software Quality Engineering. Over the years, I have evolved from a manual tester to a Full-Stack Automation Engineer, architecting resilient testing frameworks for complex banking systems at ING and continuously exploring the frontiers of AI-driven development. For me, coding is not just about functional correctness—it's about crafting reliable, scalable ecosystems that empower teams to innovate with confidence.",
  "yearsExperience": "Years Experience",
  "myJourney": "My Journey",
  "whatIDo": "What I Do",
  "basedIn": "Based in",
  "netherlands": "Netherlands",
  "languages": "Languages",
  "languageList": "English, Dutch, Turkish",
  "badges": {
    "istqbCertified": "ISTQB® Certified",
    "agileScrum": "Agile & Scrum",
    "fullStackQA": "Full-Stack QA"
  },
  "services": {
    "testAutomation": {
      "title": "Test Automation Architecture",
      "description": "Building robust, scalable end-to-end automation frameworks to ensure software quality and reliability.",
      "badge": "Core Expertise",
      "fullDescription": "I specialize in designing and implementing enterprise-grade test automation frameworks that scale with your business. From UI testing with Selenium and Playwright to API validation with REST Assured, I build comprehensive solutions that catch bugs before they reach production. My frameworks follow clean architecture principles with Page Object Model, making them maintainable and easy for teams to adopt.",
      "keyBenefits": [
        "Reduce regression testing time by 60%+ with parallel execution",
        "Catch critical bugs early with automated smoke and sanity tests",
        "Scale QA coverage without proportionally scaling team size",
        "Integrate seamlessly with CI/CD pipelines for continuous feedback",
        "Maintainable frameworks following industry best practices"
      ]
    },
    "cicd": {
      "title": "CI/CD & DevOps Integration",
      "description": "Designing and maintaining continuous integration pipelines to accelerate deployment and reduce risk.",
      "badge": "Certified",
      "fullDescription": "I build and optimize CI/CD pipelines that transform slow, manual deployment processes into fast, reliable automated workflows. From Jenkins to Azure DevOps, I configure pipelines that run automated tests on every commit, provide instant feedback to developers, and deploy to production with confidence. My approach includes containerization with Docker, automated test execution, and comprehensive reporting.",
      "keyBenefits": [
        "Accelerate deployment cycles from weeks to hours",
        "Automated testing on every code commit for instant feedback",
        "Reduce deployment failures with comprehensive validation",
        "Docker containerization for consistent environments",
        "Detailed reports and notifications for team visibility"
      ]
    },
    "apiBackend": {
      "title": "API & Backend Validation",
      "description": "Implementing comprehensive API testing strategies and database validations for backend integrity.",
      "badge": "Core Expertise",
      "fullDescription": "Backend quality is critical to application stability. I design comprehensive API testing strategies using REST Assured and Postman, validating requests, responses, authentication, error handling, and data integrity. My approach includes database validation with SQL to ensure data consistency, performance testing to identify bottlenecks, and security testing to protect sensitive information.",
      "keyBenefits": [
        "Comprehensive API test coverage (CRUD, auth, error handling)",
        "Database validation ensuring data integrity across layers",
        "Performance and load testing to identify bottlenecks",
        "Security testing for authentication and authorization",
        "Automated contract testing between services"
      ]
    },
    "webDev": {
      "title": "AI-Powered Web Development",
      "description": "Leveraging advanced AI coding agents and modern architectural patterns to build professional, high-performance web applications with speed and precision.",
      "badge": "Innovation",
      "fullDescription": "Modern web development requires speed without sacrificing quality. I combine AI-powered development tools with proven architectural patterns to deliver professional web applications rapidly. Using React, TypeScript, and modern tooling, I build responsive, performant applications that provide exceptional user experiences. My approach emphasizes clean code, accessibility, and SEO optimization from day one.",
      "keyBenefits": [
        "Rapid prototyping and MVP development in days, not weeks",
        "Modern tech stack (React, TypeScript, Tailwind CSS)",
        "SEO-optimized and accessibility-compliant from the start",
        "Responsive design for all devices and screen sizes",
        "Production-ready code with best practices"
      ]
    },
    "ecommerce": {
      "title": "E-commerce Sales Optimization",
      "description": "Implementing data-driven sales strategies and SEO techniques to maximize product visibility and revenue across major e-commerce platforms like Amazon and eBay.",
      "badge": "Strategic Growth",
      "fullDescription": "E-commerce success requires more than just listing products—it demands strategic optimization and continuous improvement. I leverage advanced SEO techniques, competitive analysis, and data-driven strategies to maximize product visibility and conversion rates on major platforms like Amazon, eBay, and AutoDoc. My approach includes keyword optimization, sponsored advertising campaigns, inventory management, and pricing strategies that drive revenue growth.",
      "keyBenefits": [
        "Increase organic visibility through strategic SEO optimization",
        "Data-driven pricing and inventory strategies",
        "High-ROI sponsored advertising campaigns",
        "Multi-platform management (Amazon, eBay, AutoDoc)",
        "Analytics and reporting for informed decision-making"
      ]
    },
    "details": {
      "overview": "Overview",
      "keyBenefits": "Key Benefits",
      "technologies": "Technologies & Tools",
      "relatedProjects": "Related Projects",
      "getInTouch": "Get in Touch",
      "yearsOfExperience": "Years of Experience",
      "provenExpertise": "Proven expertise in production environments"
    }
  }
}
