{
  "title": "Resume",
  "titleHighlight": "My",
  "sections": {
    "education": "Education",
    "experience": "Experience",
    "skills": "Skills",
    "techStack": "Tech Stack",
    "languages": "Languages"
  },
  "education": [
    {
      "date": "June 2022 - June 2023",
      "title": "Bachelor of Engineering - Full-Stack Automation Engineering",
      "company": "TechPro Education - Online/Remote",
      "description": "Key Skills Developed: Test Automation (Selenium WebDriver, Cypress, Postman API, REST APIs, RESTful WebServices), CI/CD (Jenkins), Frameworks (Hybrid Framework, Cucumber/BDD), Languages/Tools (Java, Gherkin, SQL, Maven, TestNG, JUnit), Methodologies (Agile, Scrum, SDLC, QA Engineering, Test Planning), and more."
    },
    {
      "date": "September 2019 - April 2020",
      "title": "Software Developer",
      "company": "ROC van Twente - Enschede, Netherlands",
      "description": "Key Skills Developed: Core Programming (C#, JavaScript), Database Management (SQL, T-SQL, MongoDB), Version Control (Git, GitHub), Web Fundamentals (HTML, CSS), and Object-Oriented Programming (OOP)."
    },
    {
      "date": "October 2017 - March 2018",
      "title": "Full-Stack Web Development",
      "company": "HackYourFuture - Amsterdam, Netherlands",
      "description": "Key Skills Developed: Web Technologies (HTML, CSS, JavaScript), API Testing, Version Control (Git, GitHub), C#, SQL, and Object-Oriented Programming (OOP)."
    },
    {
      "date": "September 2007 - July 2013",
      "title": "Bachelor of Applied Science - Mathematics",
      "company": "Istanbul University - Istanbul, Turkey",
      "description": "Relevant Coursework and Skills: Differential Equations, Complex Analysis, Probability & Statistics, Advanced Calculus, General Physics, and skills in Abstract Reasoning, Systematic Problem Solving, and Data Analysis."
    }
  ],
  "experience": [
    {
      "date": "Jun 2023 - Sep 2025",
      "title": "Automation Engineer (PSS/True International Payments/Ch Dovetail)",
      "company": "ING Bank - Amsterdam, North Holland, Netherlands · Hybrid",
      "description": "As an Automation Test Engineer at ING's TIP Test Center (TTC), I designed and maintained automated end-to-end tests for real-time payment processing within the Dovetail system, a Fiserv payment platform, ensuring transaction accuracy across international branches. My responsibilities included designing test validations for various payment flows, managing and optimizing test data to accelerate deployment, and collaborating closely with development teams and stakeholders to ensure seamless integration with the automation framework."
    },
    {
      "date": "Jun 2022 - Jun 2023",
      "title": "Full-Stack Automation Engineer (SDET)",
      "company": "TechPro Education EU - Netherlands · Remote",
      "description": "Developed and managed a comprehensive Automation Framework based on acceptance criteria using Selenium WebDriver, Java, JUnit, and Cucumber. Executed UI, backend, and database tests for a hospital portal, covering functionalities like patient management and appointment scheduling. Performed API testing with Postman and Rest Assured, managed dependencies via Maven, and integrated CI/CD pipelines with Jenkins in an Agile environment."
    },
    {
      "date": "May 2021 - Jan 2023",
      "title": "Manual Tester & e-Commerce Specialist",
      "company": "BSG Auto Parts & Nerex Motors - Amsterdam, Netherlands · On-site",
      "description": "Played a pivotal role at Nerex Motors enhancing e-commerce strategies and product quality. Conducted manual testing on ERP systems to maintain high functionality standards, improved product search visibility on Amazon and eBay, and implemented strategic ad campaigns driving online sales. Successfully managed the Online Channel (AutoDoc) sales process for BSG Auto Parts, fostering B2B growth by developing tailored sales strategies, cultivating strong relationships with key accounts, and negotiating competitive commercial terms."
    },
    {
      "date": "Mar 2019 - Sep 2020",
      "title": "Student Affairs & Content Coordinator",
      "company": "LiveCoding | Online Web Development Bootcamp - Netherlands · Remote",
      "description": "Played a key role in enhancing the student experience at LiveCoding through comprehensive support and engagement initiatives. Delivered tailored counseling to online students, helping them overcome various challenges. Organized and executed virtual activities to strengthen community ties among students. Maintained accurate student records, ensuring compliance with program policies and tracking progress effectively."
    },
    {
      "date": "Jul 2017 - Sep 2020",
      "title": "FerriStar - Evergreen Niches",
      "company": "eBay - Netherlands · Self-employed",
      "description": "Successfully contributed to FerriStar's mission of providing curated best sellers and evergreen essentials. Developed strong relationships with suppliers to ensure a consistent supply of high-quality products. Focused on enhancing customer experience through thoughtful product selection in various categories. Gained expertise in e-commerce and product curation, reinforcing FerriStar's reputation in the market."
    },
    {
      "date": "Sep 2016 - Mar 2017",
      "title": "Mathematics Instructor",
      "company": "Mohammed Al Fatih Schools - El Jadida, Morocco · On-site",
      "description": "Contributed significantly to mathematics instruction focusing on holistic student development. Employed interdisciplinary connections to enhance lesson relevance and student engagement. Collaborated with colleagues to support extracurricular activities and pastoral care initiatives."
    },
    {
      "date": "Sep 2014 - Sep 2016",
      "title": "Mathematics Instructor",
      "company": "LUMINA Educational Institutions - Bucharest, Romania · On-site",
      "description": "I had the privilege of teaching advanced mathematics at LUMINA Educational Institutions, where I focused on fostering student success in a diverse learning environment. Designed and graded internal assessments, providing detailed reports on student progress and predicted grades. Differentiated instruction to support students from various educational backgrounds, maintaining high international standards. Mentored students on their academic pathways, guiding them toward STEM-related university goals."
    },
    {
      "date": "Mar 2012 - Sep 2014",
      "title": "Volunteer Assistant",
      "company": "Fiader - Istanbul, Turkey · Part-time",
      "description": "Played a key role in supporting Fiader's mission through effective volunteer coordination and administrative tasks. Managed volunteer records and scheduled shifts to optimize resource allocation. Assisted in organizing events and training sessions, ensuring all logistics were in place. Acted as a primary point of contact, enhancing communication and volunteer engagement."
    }
  ],
  "skills": {
    "testAutomation": "Test Automation",
    "javaEcosystem": "Java & Ecosystem",
    "seleniumCucumber": "Selenium & Cucumber",
    "playwrightCypress": "Playwright & Cypress (TS)",
    "apiTesting": "API Testing (Rest Assured)",
    "cicd": "CI/CD (Jenkins & Azure)",
    "docker": "Docker & Containerization",
    "sql": "SQL & Databases"
  },
  "languageLevels": {
    "native": "Native",
    "professional": "Professional (C1)",
    "intermediate": "Intermediate (B2)",
    "beginner": "Beginner (A1)"
  }
}
